@aareet 
```
$ tf init

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "helm" (hashicorp/helm) 1.3.1...
- Downloading plugin for provider "kubernetes" (hashicorp/kubernetes) 1.13.2...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings  
suggested below.

* provider.helm: version = "~> 1.3"
* provider.kubernetes: version = "~> 1.13"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

abhinav.khanna@abhinavkha-ltw1 MINGW64 ~/git/temp-tf
$ tf apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.instana-agent will be created
  + resource "helm_release" "instana-agent" {
      + atomic                     = false
      + chart                      = "instana-agent"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "instana-agent"
      + namespace                  = "terraform-example-namespace"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true
    }

  # kubernetes_namespace.instana-agent will be created
  + resource "kubernetes_namespace" "instana-agent" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "terraform-example-namespace"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_namespace.instana-agent: Creating...
kubernetes_namespace.instana-agent: Creation complete after 2s [id=terraform-example-namespace]
helm_release.instana-agent: Creating...

Error: failed to download "https://kubernetes-charts.storage.googleapis.com/instana-agent-1.0.30.tgz" (hint: running `helm repo update` may help)

  on sonarqube.tf line 1, in resource "helm_release" "instana-agent":
   1: resource "helm_release" "instana-agent" {

```